Show / Hide Table of Contents
Namespace IdeaStatiCa.Plugin.Grpc.Reflection
Classes
GrpcReflectionArgument
Represents an argument that Grpc will use to call the method invoked via reflection.
GrpcReflectionCallbackData
Contains response returned from Grpc service.
GrpcReflectionClient
Client for the GrpcReflectionMessageHandler enabled GrpcClient
GrpcReflectionInvokeData
Invokes a method over Grpc.
GrpcReflectionMessageHandler
Handler that invokes methods for specified object over Grpc via reflection.
GrpcReflectionMethodAttribute
Determines that method decorated with this attribute is a grpc reflection service method.
GrpcReflectionServer
Instance of GrpcServer with Reflection Service added.
GrpcReflectionServiceAttribute
Determines that interface decorated with this attribtue is a grpc reflection service.
GrpcServiceBasedReflectionClient<IReflectionService>
WCF-like implementation of the GrpcReflectionClient that uses interceptors to proxy calls to server.